package main

import (
	"fmt"
)




 func main(){
    //长度相同 类型相同 才能使用=赋值
 	var a [2]int //[0,0]
 	var b [1]int
 	c := [2]int{1} //字面值不够 使用零值
	 d := [20]int{19:1} //将第19个赋值为1
	 e := [...]int{1,2,3,4,5}
	 f := [...]int{0:1,1:2,4,5,5}
	 g := [...]int{19:1}

	 var p *[20]int = &d //取d的地址 p的类型和d的类型必须相同
      // a == b //true
      p = new( [20]int )

      k := [2][3]int{
		  {1,1,1},
		  {2,2,2} }//花括号要放在同一行

	 m := [...][3]int{//顶级的元素个数可以使用...进行自动计算
		 {1:1},
		 {2:2} }//花括号要放在同一行

	 fmt.Println( a, b, c, d, e, f, g, p, k, m )




 }